## Create final acres (final_acres)
### Create a dataframe with a single row per month, containing a column with total acres, columns for wind data, and columns for mean aqi, max aqi, and min aqi.  Write to a table named final_data.

In [1]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np

%matplotlib inline

In [2]:
rds_connection_string = "root:12345678@127.0.0.1/fires"
engine = create_engine(f'mysql+pymysql://{rds_connection_string}')

In [3]:
data = pd.read_sql("select * from binned_by_acres", con=engine)
data.head()

/anaconda3/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  result = self._query(query)

   index       date  overall_aqi  fire_id  size    distance             bins
0      0 2001-01-01          153   8659.0   0.1  380.928215  bigger then 300
1      1 2001-01-01          153   9387.0   0.1  136.804378       within 150
2      2 2001-01-01          153  17163.0   0.1  251.976491       within 300
3      3 2001-01-01          153  30114.0   0.1  200.715760       within 250
4      4 2001-01-01          153  30201.0   0.1  467.441792  bigger then 300

In [4]:
data = data[['date', 'overall_aqi', 'fire_id', 'size']]
data.head()

        date  overall_aqi  fire_id  size
0 2001-01-01          153   8659.0   0.1
1 2001-01-01          153   9387.0   0.1
2 2001-01-01          153  17163.0   0.1
3 2001-01-01          153  30114.0   0.1
4 2001-01-01          153  30201.0   0.1

## Group by date (ie create total acres  per month)
* Note: because we only count acres burned on its end date, we need to group our dates by something larger then a day

In [5]:
# data.groupby(['bins','fire_id'])['size'].sum()

In [6]:
# test_group = data.groupby(pd.Grouper(key="date", freq="M"))['size'].sum()

In [7]:
grouped_acres = data.groupby([pd.Grouper(key="date", freq="M")])['size'].sum()

In [8]:
type(grouped_acres)

pandas.core.series.Series

In [9]:
grouped_acres.head(30)

date
2001-01-31     10551.00
2001-02-28        85.60
2001-03-31       293.20
2001-04-30        92.70
2001-05-31      4812.70
2001-06-30     12952.80
2001-07-31     29837.20
2001-08-31    177304.70
2001-09-30     41574.00
2001-10-31     17925.10
2001-11-30       327.10
2001-12-31      1395.90
2002-01-31       139.70
2002-02-28      2829.40
2002-03-31      3824.50
2002-04-30      1240.70
2002-05-31      9201.20
2002-06-30     73042.20
2002-07-31     68693.30
2002-08-31    224608.60
2002-09-30     14746.00
2002-10-31     42643.20
2002-11-30      4874.10
2002-12-31      3161.50
2003-01-31      1077.35
2003-02-28        22.35
2003-03-31       169.66
2003-04-30       785.25
2003-05-31       939.45
2003-06-30      5097.72
Freq: M, Name: size, dtype: float64

In [10]:
grouped_acres = grouped_acres.to_frame()

In [11]:
grouped_acres.head()

               size
date
2001-01-31  10551.0
2001-02-28     85.6
2001-03-31    293.2
2001-04-30     92.7
2001-05-31   4812.7

In [12]:
grouped_acres = grouped_acres.fillna(0)

In [13]:
grouped_acres.head()

               size
date
2001-01-31  10551.0
2001-02-28     85.6
2001-03-31    293.2
2001-04-30     92.7
2001-05-31   4812.7

## Group by air quality-- max, min, and avg

In [14]:
max_aqi = data.groupby([pd.Grouper(key="date", freq="M")])['overall_aqi'].max()

In [15]:
max_aqi = max_aqi.to_frame()
max_aqi.columns = ['max_aqi']
max_aqi.head()

            max_aqi
date
2001-01-31      158
2001-02-28      117
2001-03-31       66
2001-04-30       49
2001-05-31       67

In [16]:
min_aqi=data.groupby([pd.Grouper(key="date", freq="M")])['overall_aqi'].min()

In [17]:
min_aqi = min_aqi.to_frame()
min_aqi.columns = ['min_aqi']
min_aqi.head()

            min_aqi
date
2001-01-31       25
2001-02-28       30
2001-03-31       22
2001-04-30       23
2001-05-31       24

In [18]:
mean_aqi=data.groupby([pd.Grouper(key="date", freq="M")])['overall_aqi'].mean()

In [19]:
mean_aqi = mean_aqi.to_frame()
mean_aqi.columns = ['mean_aqi']
mean_aqi.head()

              mean_aqi
date
2001-01-31  100.569620
2001-02-28   44.411765
2001-03-31   39.555556
2001-04-30   37.675325
2001-05-31   39.112532

## Group by wind data

In [20]:
wind_data = pd.read_sql("select * from wind_data", con=engine)

In [21]:
wind_data = wind_data[['date', 'avg_daily_wind_speed', 'fastest_2_min_speed', 'fastest_5_min_speed']]
wind_data.head()

         date  avg_daily_wind_speed  fastest_2_min_speed  fastest_5_min_speed
0  2000-12-01                  3.58                 14.1                 16.1
1  2000-12-02                  2.91                  8.1                  8.9
2  2000-12-03                  3.80                 13.0                 14.1
3  2000-12-04                  2.91                  8.9                 10.1
4  2000-12-05                  4.03                 10.1                 12.1

In [22]:
wind_data.dtypes

date                     object
avg_daily_wind_speed    float64
fastest_2_min_speed     float64
fastest_5_min_speed     float64
dtype: object

In [23]:
type(wind_data['date'][0])

str

In [24]:
wind_data['date'] = pd.to_datetime(wind_data['date'])

In [25]:
wind_data.dtypes

date                    datetime64[ns]
avg_daily_wind_speed           float64
fastest_2_min_speed            float64
fastest_5_min_speed            float64
dtype: object

In [26]:
wind_group = wind_data.groupby([pd.Grouper(key="date", freq="M")]).mean()

In [27]:
wind_group.columns = 'avg_daily_wind_speed', 'avg_fastest_2_min', 'avg_fastest_5_min'

In [28]:
wind_group.head()

            avg_daily_wind_speed  avg_fastest_2_min  avg_fastest_5_min
date
2000-12-31              5.138710          13.396774          15.980645
2001-01-31              7.288387          17.819355          20.503226
2001-02-28              9.355000          20.346429          24.346429
2001-03-31             10.615161          23.780645          27.629032
2001-04-30             13.646000          28.426667          33.153333

## Merge them

In [30]:
grouped_acres.head()

               size
date
2001-01-31  10551.0
2001-02-28     85.6
2001-03-31    293.2
2001-04-30     92.7
2001-05-31   4812.7

In [31]:
all_data = pd.merge(grouped_acres, wind_group, on="date")
all_data.head()

,size,avg_daily_wind_speed,avg_fastest_2_min,avg_fastest_5_min
date,,,,
2001-01-31,10551.0,7.288387,17.819355,20.503226
2001-02-28,85.6,9.355000,20.346429,24.346429
2001-03-31,293.2,10.615161,23.780645,27.629032
2001-04-30,92.7,13.646000,28.426667,33.153333
2001-05-31,4812.7,12.714516,25.632258,29.509677

In [32]:
all_data = pd.merge(all_data, mean_aqi, on="date")

In [33]:
all_data = pd.merge(all_data, max_aqi, on="date")

In [34]:
all_data = pd.merge(all_data, min_aqi, on="date")

In [35]:
all_data.head()

,size,avg_daily_wind_speed,avg_fastest_2_min,avg_fastest_5_min,mean_aqi,max_aqi,min_aqi
date,,,,,,,
2001-01-31,10551.0,7.288387,17.819355,20.503226,100.569620,158,25
2001-02-28,85.6,9.355000,20.346429,24.346429,44.411765,117,30
2001-03-31,293.2,10.615161,23.780645,27.629032,39.555556,66,22
2001-04-30,92.7,13.646000,28.426667,33.153333,37.675325,49,23
2001-05-31,4812.7,12.714516,25.632258,29.509677,39.112532,67,24

## Write to database

In [36]:
all_data.to_sql(name="final_acres", con=engine, if_exists="replace", index=True)